Revit 2024 API
BuiltInFailures.DimensionFailures.DimensionReferencesInvalid Property
 One or more dimension references are or have become invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DimensionReferencesInvalid { get; }
Visual Basic
Public Shared ReadOnly Property DimensionReferencesInvalid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DimensionReferencesInvalid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace